/*2.2执行帮助查看命令*/
1. man --help \ -h

/*2.3常用系统工作命令*/
1. ehco    	==print
2. date		
3. reboot		
4. poweroff
5. weget		下载文件
6. ps		查看系统进程
7. top
8. pidof		
9. kill
10. killall

/*2.4系统状态检测*/
1. ifconfig  获取网卡配置与网络状态信息
2. uname     查看系统内核与系统版本等信息
3. uptime    查看系统负载信息
4. free     查看当前系统中内存的使用量        
5. who       登入主机的用户信息
6. last     所有系统登录信息
7. history  历史命令
8. sosreport用于收集系统配置及架构信息

/*2.5 工作目录切换*/
1. pwd       显示用户当前所处工作目录
2. cd        切换工作路径
3. ls       显示目录文件信息

/*2.6 文本文件编辑命令*/
1. cat      查看纯文本文件（内容少）
2. more     查看纯文本文件（内容多）
3. head     查看纯文本文件前N行
4. tail     查看纯文本文件后N行
5. tr       替换文本中的字符
6. wc       统计文本行数、字数、字节数
7. stat     查看文件的具体存储信息和时间
8. cut      
9. diff     比较多个文本文件差异

/*2.7 文件目录管理*/
1. touch    创建空白文件或者设置文件时间
2. mkdir    创建空白目录
3. cp       复制文件或目录
4. mv       剪切或重命名文件
5. rm       删除文件或目录
6. dd       复制或转换文件
7. file     查看文件类型


/*2.8 打包压缩与搜索*/
1. tar -czvf压缩  -xzvf解压
2. grep     文本中关键词搜索
3. find     查找文件







